{
    "lang": "si",

    "home": {
        "contact-me": "kontakt",
        "download-cv": "CV",
        "text-greeting": "Pozdravljeni, moje ime je",
        "text-name": "Tilen",
        "text-ima": "Sem",
        "text-software-engineer": "programski razvijalec",
        "text-with": "in imam",
        "text-exp": "10 let izkušenj s programiranjem",
        "text-joy": "Moje strasti so",
        "text-mmrp": "glasba, matematika in razvedrilno programiranje",
        "text-fcs": "Moj trenutni fokus je",
        "text-react": "React (Next.js)"
    },

    "about": {
        "title": "o meni",
        "how-start": "Moja programerska avantura se je pricela ko se bil star 14 let in sem dobil svoj prvi prenosni racunalnik. Imel sem le eno zeljo: igrati Minecraft. Nisem uspel si privosciti nakupa igre toda na mojo sreco sem bil seznanjen z objavo na spletnem poratlu MinecraftForum, ki je obljubila brezplacno razlicico igre Minecraft kot nagrado novim razvijalcem modifikacij igre.",
        "q1": "Zakaj pa ne? Saj programiranje v jeziku Java je enostavno, mar ne?",
        "after-start": "Po opravljeni srednji soli in presenetljivem uspehu znotraj Minecraft skupnosti modificerjev, sem se zavedal, da je programiranje moja strast. Zaljubljen sem v ustvarnaje novih in uporabnih resitev problemov s katerimi se vsakodnevno srecujem.",
        "q2": "Rad rešujem probleme z uporabo računalnikov in matematike.",
        "end": "Raziskovanje področja računalništva in tehonologije so moje življenjske sanje!",
        "music-p1-s": "Moja strast je tudi glasba. Sem kitarist in basist samouk in upam, da bom nekoč osvojil tudi veščino igranja klavirja saj je to eden od mojih najljubših instrumentov.",
        "music-p2-s1": "Zanima me raziskovanje",
        "music-p2-sb": "glasbene vizualizacije",
        "music-p2-s2": "z uporabo računalnikov v upanju, da bom dosegel novo obliko umetniškega izražanja prek glasbe in videa.",
        "music-p3": "V prostem času rad pišem tudi poezijo. Svojo muzo najdem v romantiki in postmodernih pesniških slogih."
    },

    "project": {
        "title": "moji projekti",
        "boat-title": "Boat Configurator",
        "boat-description": "Uporabniki lahko ustvarijo svojo konfiguracijo jahte in zajo pošljejo kot povpraševanje.",
        "rack-title": "Rack Configurator",
        "rack-description": "Uporabniki lahko ustvarijo in kupijo svoje konfiguracije fitnes stojal.",
        "pdfb-title": "PDFb",
        "pdfb-description": "Knjižnica, ki se lahko uporablja za ustvarjanje pdf datotek.",
        "ppp-title": "PDF PreProcessor",
        "ppp-description": "stb style header knjižnica, ki se lahko uporablja kot orodje za pridobivanje in razčlenjevanje vsebine iz datotek pdf v različne podatkovne formate.",
        "zenc-title": "ZenChat.app",
        "zenc-description": "Preprosta spletna aplikacija za klepet, ki ljudem omogoča pisanje in pošiljanje sporočil.",
        "gena-title": "Genetic Alghoritems",
        "gena-description": "Kot šolski projekt sem implementiral zaporedne, vzporedne in porazdeljene rešitve za problem potujočega prodajalca z uporabo generičnih algoritmov."
    },

    "skills": {
        "title": "moje spretnosti"
    },

    "experience": {
        "title": "moje izkušnje",
        "minmod-title": "minecraft modificiranje",
        "minmod-location": "slovenia",
        "minmod-description": "Začel sem se učiti Javo - svoj prvi programski jezik. Učil sem se iz youtuba in drugih brezplačnih internetnih virov. Svoja ustvarjanja semtudi redno objvaljal na minecraft forumih in ostalih minecraft spletnih portalih",
        "govir-title": "zaslovel",
        "govir-location": "internet",
        "govir-description": "S prijatelji, ki sem jih spoznal na spletu, sem se pogovarjal o modifikaciji Minecrafta z imenom 'Roots'. Po približno letu dni razvoja je projekt zaslovel in dosegel več kot 5 milijonov prenosov.",
        "ghs-title": "graduated high school",
        "ghs-location": "slovenia",
        "ghs-description": "I graduated from my tehnical school lol"
    },

    "contact": {
        "title": "kontakt",
        "direct-1": "Prosim, kontaktirajte me neposredno na",
        "direct-2": "ali prek tega obrazca:",
        "message-placeholder": "vaše sporočilo",
        "submit-btn": "pošlji"
    }
}
